  ### Deployment Results ✅

  **ryano0oceros** successfully **noop** deployed branch `demo` to **production**

  <details><summary>Show Results</summary>

  ```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.vpc.aws_default_network_acl.this[0] will be created
+ resource "aws_default_network_acl" "this" {
    + arn                    = (known after apply)
    + default_network_acl_id = (known after apply)
    + id                     = (known after apply)
    + owner_id               = (known after apply)
    + tags                   = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-default"
      }
    + tags_all               = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-default"
      }
    + vpc_id                 = (known after apply)

    + egress {
        + action          = "allow"
        + from_port       = 0
        + ipv6_cidr_block = "::/0"
        + protocol        = "-1"
        + rule_no         = 101
        + to_port         = 0
      }
    + egress {
        + action     = "allow"
        + cidr_block = "0.0.0.0/0"
        + from_port  = 0
        + protocol   = "-1"
        + rule_no    = 100
        + to_port    = 0
      }

    + ingress {
        + action          = "allow"
        + from_port       = 0
        + ipv6_cidr_block = "::/0"
        + protocol        = "-1"
        + rule_no         = 101
        + to_port         = 0
      }
    + ingress {
        + action     = "allow"
        + cidr_block = "0.0.0.0/0"
        + from_port  = 0
        + protocol   = "-1"
        + rule_no    = 100
        + to_port    = 0
      }
  }

# module.vpc.aws_default_route_table.default[0] will be created
+ resource "aws_default_route_table" "default" {
    + arn                    = (known after apply)
    + default_route_table_id = (known after apply)
    + id                     = (known after apply)
    + owner_id               = (known after apply)
    + route                  = (known after apply)
    + tags                   = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-default"
      }
    + tags_all               = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-default"
      }
    + vpc_id                 = (known after apply)

    + timeouts {
        + create = "5m"
        + update = "5m"
      }
  }

# module.vpc.aws_default_security_group.this[0] will be created
+ resource "aws_default_security_group" "this" {
    + arn                    = (known after apply)
    + description            = (known after apply)
    + egress                 = (known after apply)
    + id                     = (known after apply)
    + ingress                = (known after apply)
    + name                   = (known after apply)
    + name_prefix            = (known after apply)
    + owner_id               = (known after apply)
    + revoke_rules_on_delete = false
    + tags                   = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-default"
      }
    + tags_all               = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-default"
      }
    + vpc_id                 = (known after apply)
  }

# module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
    + arn              = (known after apply)
    + id               = (known after apply)
    + owner_id         = (known after apply)
    + propagating_vgws = (known after apply)
    + route            = (known after apply)
    + tags             = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1a"
      }
    + tags_all         = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1a"
      }
    + vpc_id           = (known after apply)
  }

# module.vpc.aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
    + arn              = (known after apply)
    + id               = (known after apply)
    + owner_id         = (known after apply)
    + propagating_vgws = (known after apply)
    + route            = (known after apply)
    + tags             = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1b"
      }
    + tags_all         = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1b"
      }
    + vpc_id           = (known after apply)
  }

# module.vpc.aws_route_table.private[2] will be created
+ resource "aws_route_table" "private" {
    + arn              = (known after apply)
    + id               = (known after apply)
    + owner_id         = (known after apply)
    + propagating_vgws = (known after apply)
    + route            = (known after apply)
    + tags             = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1c"
      }
    + tags_all         = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1c"
      }
    + vpc_id           = (known after apply)
  }

# module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_route_table_association.private[2] will be created
+ resource "aws_route_table_association" "private" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
    + arn                                            = (known after apply)
    + assign_ipv6_address_on_creation                = false
    + availability_zone                              = "us-east-1a"
    + availability_zone_id                           = (known after apply)
    + cidr_block                                     = "10.24.0.0/20"
    + enable_dns64                                   = false
    + enable_resource_name_dns_a_record_on_launch    = false
    + enable_resource_name_dns_aaaa_record_on_launch = false
    + id                                             = (known after apply)
    + ipv6_cidr_block_association_id                 = (known after apply)
    + ipv6_native                                    = false
    + map_public_ip_on_launch                        = false
    + owner_id                                       = (known after apply)
    + private_dns_hostname_type_on_launch            = (known after apply)
    + tags                                           = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1a"
      }
    + tags_all                                       = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1a"
      }
    + vpc_id                                         = (known after apply)
  }

# module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
    + arn                                            = (known after apply)
    + assign_ipv6_address_on_creation                = false
    + availability_zone                              = "us-east-1b"
    + availability_zone_id                           = (known after apply)
    + cidr_block                                     = "10.24.16.0/20"
    + enable_dns64                                   = false
    + enable_resource_name_dns_a_record_on_launch    = false
    + enable_resource_name_dns_aaaa_record_on_launch = false
    + id                                             = (known after apply)
    + ipv6_cidr_block_association_id                 = (known after apply)
    + ipv6_native                                    = false
    + map_public_ip_on_launch                        = false
    + owner_id                                       = (known after apply)
    + private_dns_hostname_type_on_launch            = (known after apply)
    + tags                                           = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1b"
      }
    + tags_all                                       = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1b"
      }
    + vpc_id                                         = (known after apply)
  }

# module.vpc.aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
    + arn                                            = (known after apply)
    + assign_ipv6_address_on_creation                = false
    + availability_zone                              = "us-east-1c"
    + availability_zone_id                           = (known after apply)
    + cidr_block                                     = "10.24.32.0/20"
    + enable_dns64                                   = false
    + enable_resource_name_dns_a_record_on_launch    = false
    + enable_resource_name_dns_aaaa_record_on_launch = false
    + id                                             = (known after apply)
    + ipv6_cidr_block_association_id                 = (known after apply)
    + ipv6_native                                    = false
    + map_public_ip_on_launch                        = false
    + owner_id                                       = (known after apply)
    + private_dns_hostname_type_on_launch            = (known after apply)
    + tags                                           = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1c"
      }
    + tags_all                                       = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform-private-us-east-1c"
      }
    + vpc_id                                         = (known after apply)
  }

# module.vpc.aws_vpc.this[0] will be created
+ resource "aws_vpc" "this" {
    + arn                                  = (known after apply)
    + cidr_block                           = "10.24.0.0/16"
    + default_network_acl_id               = (known after apply)
    + default_route_table_id               = (known after apply)
    + default_security_group_id            = (known after apply)
    + dhcp_options_id                      = (known after apply)
    + enable_dns_hostnames                 = true
    + enable_dns_support                   = true
    + enable_network_address_usage_metrics = (known after apply)
    + id                                   = (known after apply)
    + instance_tenancy                     = "default"
    + ipv6_association_id                  = (known after apply)
    + ipv6_cidr_block                      = (known after apply)
    + ipv6_cidr_block_network_border_group = (known after apply)
    + main_route_table_id                  = (known after apply)
    + owner_id                             = (known after apply)
    + tags                                 = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform"
      }
    + tags_all                             = {
        + "Example"    = "ex-terraform"
        + "GithubOrg"  = "ryano0oceros"
        + "GithubRepo" = "ryano0oceros-at-318-tf-aws-vpc"
        + "Name"       = "ex-terraform"
      }
  }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cgw_arns                                    = []
+ cgw_ids                                     = []
+ database_nat_gateway_route_ids              = []
+ database_route_table_association_ids        = []
+ database_route_table_ids                    = (known after apply)
+ database_subnet_arns                        = []
+ database_subnets                            = []
+ database_subnets_cidr_blocks                = []
+ database_subnets_ipv6_cidr_blocks           = []
+ default_network_acl_id                      = (known after apply)
+ default_route_table_id                      = (known after apply)
+ default_security_group_id                   = (known after apply)
+ elasticache_route_table_association_ids     = []
+ elasticache_route_table_ids                 = (known after apply)
+ elasticache_subnet_arns                     = []
+ elasticache_subnets                         = []
+ elasticache_subnets_cidr_blocks             = []
+ elasticache_subnets_ipv6_cidr_blocks        = []
+ intra_route_table_association_ids           = []
+ intra_route_table_ids                       = []
+ intra_subnet_arns                           = []
+ intra_subnets                               = []
+ intra_subnets_cidr_blocks                   = []
+ intra_subnets_ipv6_cidr_blocks              = []
+ nat_ids                                     = []
+ nat_public_ips                              = []
+ natgw_ids                                   = []
+ outpost_subnet_arns                         = []
+ outpost_subnets                             = []
+ outpost_subnets_cidr_blocks                 = []
+ outpost_subnets_ipv6_cidr_blocks            = []
+ private_ipv6_egress_route_ids               = []
+ private_nat_gateway_route_ids               = []
+ private_route_table_association_ids         = [
    + (known after apply),
    + (known after apply),
    + (known after apply),
  ]
+ private_route_table_ids                     = [
    + (known after apply),
    + (known after apply),
    + (known after apply),
  ]
+ private_subnet_arns                         = [
    + (known after apply),
    + (known after apply),
    + (known after apply),
  ]
+ private_subnets                             = [
    + (known after apply),
    + (known after apply),
    + (known after apply),
  ]
+ private_subnets_cidr_blocks                 = [
    + "10.24.0.0/20",
    + "10.24.16.0/20",
    + "10.24.32.0/20",
  ]
+ private_subnets_ipv6_cidr_blocks            = []
+ public_route_table_association_ids          = []
+ public_route_table_ids                      = []
+ public_subnet_arns                          = []
+ public_subnets                              = []
+ public_subnets_cidr_blocks                  = []
+ public_subnets_ipv6_cidr_blocks             = []
+ redshift_public_route_table_association_ids = []
+ redshift_route_table_association_ids        = []
+ redshift_route_table_ids                    = [
    + (known after apply),
    + (known after apply),
    + (known after apply),
  ]
+ redshift_subnet_arns                        = []
+ redshift_subnets                            = []
+ redshift_subnets_cidr_blocks                = []
+ redshift_subnets_ipv6_cidr_blocks           = []
+ this_customer_gateway                       = {}
+ vpc_arn                                     = (known after apply)
+ vpc_cidr_block                              = "10.24.0.0/16"
+ vpc_enable_dns_hostnames                    = true
+ vpc_enable_dns_support                      = true
+ vpc_flow_log_destination_type               = "cloud-watch-logs"
+ vpc_id                                      = (known after apply)
+ vpc_instance_tenancy                        = "default"
+ vpc_ipv6_association_id                     = (known after apply)
+ vpc_ipv6_cidr_block                         = (known after apply)
+ vpc_main_route_table_id                     = (known after apply)
+ vpc_owner_id                                = (known after apply)
+ vpc_secondary_cidr_blocks                   = []

Warning: Argument is deprecated

with module.vpc.aws_eip.nat,
on .terraform/modules/vpc/main.tf line 1032, in resource "aws_eip" "nat":
1032:   vpc = true

use domain attribute instead

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

  </details>